################################################################################
#
# <p>mermaidでレンダリングして出力するプラグイン。</p>
# <pre>
# {{mmd
# ここにmermaidのソース
# }}
# </pre>
#
################################################################################
package plugin::mermaid::mermaid;

#==============================================================================
# コンストラクタ
#==============================================================================
sub new {
	my $class = shift;
	my $self = {};
	return bless $self,$class;
}

#==============================================================================
# ブロックメソッド
#==============================================================================
sub block {
	my $self = shift;
	my $wiki = shift;
	my $text = shift;

	my $buf  = '<div class="mermaid">';
	foreach my $line (split(/(\r\n)|\n|\r/, $text)){
		if ($line eq ''){ next; }
		$buf .= "$line\n";
	}
	$buf .= '</div>';
	return $buf;
}

1;
